{
    "en": {
      "welcome": "Welcome to the Carbon Literacy Game",
      "intro_text": "Join the fight against climate change by understanding how your actions affect the environment. Become a leader in sustainability!",
      "understanding_carbon_literacy": "Understanding Carbon Literacy",
      "carbon_literacy_description": "Carbon literacy is the awareness and knowledge required to understand how our actions impact the environment, particularly in terms of carbon emissions...",
      "why_focus_on_carbon_literacy": "Why Focus on Carbon Literacy in Nigeria?",
      "why_focus_description": "Nigeria, as the most populous country in Africa, faces unique challenges and opportunities in addressing climate change...",
      "climate_change_awareness": "Climate Change Awareness",
      "climate_change_description": "Educating citizens about the connection between everyday activities and climate change.",
      "cultural_relevance": "Cultural and Contextual Relevance",
      "cultural_relevance_description": "Addressing localized issues like deforestation, waste management, and energy consumption.",
      "economic_benefits": "Economic and Social Benefits",
      "economic_benefits_description": "Empowering individuals to adopt eco-friendly practices that save money and improve health.",
      "global_responsibility": "Global Responsibility",
      "global_responsibility_description": "Supporting Nigeria's commitment to the Paris Agreement and global sustainability goals.",
      "how_game_helps": "How This Game Helps",
      "game_description": "This game is designed to make learning about carbon literacy engaging, accessible, and impactful...",
      "localized_content": "Localized Content",
      "localized_content_description": "Challenges tailored to Nigeria’s realities urban cities to rural areas.",
      "language_support": "Language Support",
      "language_support_description": "Translations in English, Yoruba, Igbo, and Hausa ensure accessibility.",
      "interactive_learning": "Interactive Learning",
      "interactive_learning_description": "Progress through levels and earn rewards as you learn about sustainable practices.",
      "action_oriented_education": "Action-Oriented Education",
      "action_oriented_description": "Take real actions that contribute to reducing your carbon footprint.",
      "your_role": "Your Role in Building a Sustainable Nigeria",
      "your_role_description": "As you navigate through this game, you will explore how your choices, from the food you eat to the energy you consume, impact the environment.",
      "green_future_message": "Let’s tackle climate change together. Your journey towards a greener future begins here.",
      "start_journey": "Start Your Carbon Literacy Journey Now!",
      "call_to_action": "Join the movement and become a catalyst for change. Learn, play, and make a real-world difference!",
      "play_game_button": "Play Carbon Literacy Game",
      "subscribe_to_newsletter": "Subscribe to Our Newsletter",
      "enter_email": "Enter your email",
      "email_placeholder": "you@example.com",
      "subscribe_button": "Subscribe"
    },
   
  "ig": {
    "welcome": "Nnọọ na Egwuregwu Carbon Literacy",
    "intro_text": "Sonye na ọgụ megide mgbanwe ihu igwe site n'ịghọta otú omume gị si emetụta gburugburu ebe obibi. Ghọọ onye ndu na ịdịgide ndụ!",
    "understanding_carbon_literacy": "Ịghọta Carbon Literacy",
    "carbon_literacy_description": "Carbon literacy bụ nghọta na ihe ọmụma a chọrọ iji ghọta otú omume anyị si emetụta gburugburu ebe obibi, karịsịa na echiche nke ịtụfu carbon...",
    "why_focus_on_carbon_literacy": "Gịnị mere anyị ga-eji lekwasị anya na Carbon Literacy na Naijiria?",
    "why_focus_description": "Naijiria, dịka obodo nwere ọtụtụ ndị bi na ya na Africa, nwere nsogbu na ohere pụrụ iche n'ịkụziri mgbanwe ihu igwe...",
    "climate_change_awareness": "Ịmara Banyere Mgbanwe Ihu Igwe",
    "climate_change_description": "Ịkụziri ndị mmadụ banyere njikọ dị n'etiti omume kwa ụbọchị na mgbanwe ihu igwe.",
    "cultural_relevance": "Mmetụta Omenala na Ụfọdụ Ndị Ọma",
    "cultural_relevance_description": "Ihie ihe ndị metụtara mpaghara dịka ịkpochapụ ọhịa, njikwa ahịhịa, na iji ike.",
    "economic_benefits": "Uru Ọrụ akụ na ụba na Mmekọrịta",
    "economic_benefits_description": "Inye ndị mmadụ ikike iji nweta omume ọma gburugburu ebe obibi nke ga-enyere ha belata ego ma melite ahụike.",
    "global_responsibility": "Ọrụ nke Ụwa",
    "global_responsibility_description": "Inyere Naijiria aka imezu nkwekọrịta Paris na ebumnuche ịdịgide ndụ nke ụwa.",
    "how_game_helps": "Olee otú Egwuregwu a si enyere",
    "game_description": "Egwuregwu a e mere ka ịmụta banyere carbon literacy bụrụ ihe na-atọ ụtọ, nke a pụrụ ịnweta, ma bụrụkwa nke na-emetụta ndụ.",
    "localized_content": "Ọdịnaya Ejikọtara na Mpaghara",
    "localized_content_description": "Ị challenges kwadoro maka eziokwu Naijiria, site na obodo ruo na ime obodo.",
    "language_support": "Nkwado Asụsụ",
    "language_support_description": "Ndị asụsụ dị na Bekee, Yoruba, Igbo na Hausa na-enye ohere ịnweta.",
    "interactive_learning": "Amụta Nke A Na-eme",
    "interactive_learning_description": "Nọrọ n'azụ site na ọkwa ma nweta ụgwọ ọrụ ka ị na-amụta banyere omume na-adịgide adịgide.",
    "action_oriented_education": "Ọmụma Na-arụsi ọrụ ike",
    "action_oriented_description": "Gbaa ọsọ nke omume ndị na-enyere aka belata ụfụfu carbon gị.",
    "your_role": "Ọrụ gị n’ịmepụta Naijiria n’ime obodo",
    "your_role_description": "Ka ị na-aga n’egwuregwu a, ị ga-enwe mmasị na ịhụ ụzọ ndụ gị, site n’iri nri gị ruo n’iji ike, na-emetụta gburugburu.",
    "green_future_message": "Ka anyị na-eme atụmatụ iji mee mgbanwe ihu igwe. Igodo nke ndụ adịgide adịgide gị malitere ebe a.",
    "start_journey": "Bido Ịmụ Carbon Literacy ugbu a!",
    "call_to_action": "Bido na gburugburu ọnụ ọgụgụ na ụzọ nke mgbanwe. Mụta, gbaa egwuregwu, bụrụ mgbanwe n'ezie n'ụwa!",
    "play_game_button": "Gbaa Egwuregwu Carbon Literacy",
    "subscribe_to_newsletter": "Debanye aha maka akụkọ",
    "enter_email": "Tinye email gị",
    "email_placeholder": "you@example.com",
    "subscribe_button": "Debanye Aha"
  },
  "ha": {
    "welcome": "Maraba da Carbon Literacy Game",
    "intro_text": "Shiga yaki da canjin yanayi ta hanyar fahimtar yadda ayyukan ka ke shafar muhalli. Zama jagora a cikin dorewar muhalli!",
    "understanding_carbon_literacy": "Fahimtar Carbon Literacy",
    "carbon_literacy_description": "Carbon literacy ilimi ne da kuma fahimtar da ake bukata don fahimtar yadda ayyukanmu ke shafar muhalli, musamman ma wajen fitar da carbon...",
    "why_focus_on_carbon_literacy": "Me yasa ya kamata mu mayar da hankali kan Carbon Literacy a Najeriya?",
    "why_focus_description": "Najeriya, matsayin kasa mafi yawan al'umma a Afirka, tana fuskantar kalubale da dama wajen magance canjin yanayi...",
    "climate_change_awareness": "Sanin Canjin Yanayi",
    "climate_change_description": "Koyar da 'yan kasa game da dangantaka tsakanin ayyukan yau da kullum da canjin yanayi.",
    "cultural_relevance": "Muhimmancin Al'adu da Mahalli",
    "cultural_relevance_description": "Magance matsalolin da suka shafi yankin kamar sare dazuzzuka, kula da shara, da amfani da makamashi.",
    "economic_benefits": "Fa'idodin Tattalin Arziki da Al'umma",
    "economic_benefits_description": "Ba wa mutane damar amfani da hanyoyin muhalli masu kyau waɗanda zasu ceci kuɗi da inganta lafiya.",
    "global_responsibility": "Alhakin Duniya",
    "global_responsibility_description": "Tallafa wa Najeriya a cikin yarjejeniyar Paris da manufofin dorewar duniya.",
    "how_game_helps": "Yadda Wannan Wasa Ke Taimakawa",
    "game_description": "Wannan wasan an tsara shi ne don yin koyo game da carbon literacy mai ban sha'awa, mai sauƙi da kuma tasiri.",
    "localized_content": "Abun ciki na Gida",
    "localized_content_description": "Kwarewar da aka tsara ta musamman don yanayi na Najeriya, daga birane zuwa yankunan karkara.",
    "language_support": "Tallafin Harshe",
    "language_support_description": "Fassara cikin Ingilishi, Yoruba, Igbo, da Hausa yana tabbatar da samun dama.",
    "interactive_learning": "Koyo Mai Aiki",
    "interactive_learning_description": "Ci gaba da matakai kuma sami lada yayin da kake koyon dabaru masu dorewa.",
    "action_oriented_education": "Ilmi Mai Mayar da hankali kan Ayyuka",
    "action_oriented_description": "Yi ainihin ayyuka da ke taimakawa wajen rage fitar da carbon.",
    "your_role": "Rawar da zaka taka wajen Gina Najeriya Mai Dorewa",
    "your_role_description": "Yayin da kake tafiya a cikin wannan wasan, za ka gano yadda zabin ka, daga abincin da kake ci zuwa makamashi da kake amfani da shi, ke shafar muhalli.",
    "green_future_message": "Mu tunkari canjin yanayi tare. Tafiyarka zuwa gaba mai kore tana farawa anan.",
    "start_journey": "Fara Tafiyarka na Carbon Literacy Yanzu!",
    "call_to_action": "Shiga cikin wannan motsi ka zama mai canji. Koyi, yi wasa, kuma ka kawo bambanci a duniya!",
    "play_game_button": "Yi Wasa da Carbon Literacy Game",
    "subscribe_to_newsletter": "Yi Rajista don Sabuwar Labarai",
    "enter_email": "Shigar da imel ɗinka",
    "email_placeholder": "you@example.com",
    "subscribe_button": "Yi Rajista"
  },
  "yo": {
    "welcome": "Kaabo si Ere Imọ-ọrọ Erogba",
    "intro_text": "Darapọ mọ ija lodi si iyipada oju-ọjọ nipa imọ bi awọn iṣe rẹ ṣe ni ipa ayika. Di olori ni ilolupo!",
    "understanding_carbon_literacy": "Imọ-ọrọ Erogba",
    "carbon_literacy_description": "Imọ-ọrọ erogba ni imọ ati alaye ti o nilo lati loye bi awọn iṣe wa ṣe ni ipa ayika, ni pataki ni awọn ofin ti idasilẹ erogba...",
    "why_focus_on_carbon_literacy": "Kilode ti a fi yẹ ki a fojusi Imọ-ọrọ Erogba ni Naijiria?",
    "why_focus_description": "Naijiria, gẹgẹbi orilẹ-ede ti o ni awọn olugbe julọ ni Afirika, ni awọn italaya ati awọn anfani alailẹgbẹ ni ipade iyipada oju-ọjọ...",
    "climate_change_awareness": "Imọ nipa Iyipada Oju-ọjọ",
    "climate_change_description": "Kọ awọn ara ilu nipa asopọ laarin awọn iṣẹ ojoojumọ ati iyipada oju-ọjọ.",
    "cultural_relevance": "Ibamu Aṣa ati Ipo",
    "cultural_relevance_description": "Iṣoro agbegbe bii igbo, iṣakoso idoti, ati lilo agbara.",
    "economic_benefits": "Awọn Anfani Iṣuna ati Awujọ",
    "economic_benefits_description": "Fi agbara han awọn eniyan lati gba awọn ọna ṣiṣe ayika ti o jẹ ki wọn fi owo pamọ ati mu ilera dara.",
    "global_responsibility": "Iduroṣinṣin Kariaye",
    "global_responsibility_description": "Ṣe atilẹyin fun ifaramọ Naijiria si Adehun Paris ati awọn ibi-afẹde ilolupo kariaye.",
    "how_game_helps": "Bawo ni Ere yii ṣe Nran",
    "game_description": "Ere yii jẹ apẹrẹ lati jẹ ki ẹkọ nipa imọ-ọrọ erogba jẹ alawọ ati irọrun...",
    "localized_content": "Akoonu Tó Pẹlú Agbegbe",
    "localized_content_description": "Awọn ipenija ti a ṣe amọja si awọn otito Naijiria, lati awọn ilu ilu si awọn agbegbe igberiko.",
    "language_support": "Atilẹyin Ede",
    "language_support_description": "Awọn itumọ ni Gẹẹsi, Yoruba, Igbo, ati Hausa ṣe idaniloju iraye si fun gbogbo eniyan.",
    "interactive_learning": "Ẹkọ ti o Nṣiṣẹpọ",
    "interactive_learning_description": "Lọsiwaju nipasẹ awọn ipele ati gba awọn ẹbun bi o ṣe n kọ ẹkọ nipa awọn ilana ilolupo.",
    "action_oriented_education": "Ẹkọ ti o da lori Iṣe",
    "action_oriented_description": "Gba awọn igbese gidi ti o ṣe iranlọwọ lati dinku ipa erogba rẹ.",
    "your_role": "Ipa rẹ ni kikọ Naijiria ti o ni ilolupo",
    "your_role_description": "Bi o ṣe n lọ kiri ninu ere yii, iwọ yoo ṣawari bi awọn ipinnu rẹ, lati ounjẹ ti o jẹ si agbara ti o nlo, ṣe ni ipa lori ayika.",
    "green_future_message": "Jẹ ki a koju iyipada oju-ọjọ papọ. Irin-ajo rẹ si ọjọ iwaju ti o mọ ni ibi bẹrẹ nibi.",
    "start_journey": "Bẹrẹ Irin-ajo Imọ-ọrọ Erogba rẹ Bayi!",
    "call_to_action": "Darapọ mọ irekọja naa ki o di alakoso fun iyipada. Kọ ẹkọ, ṣere, ki o ṣe iyatọ gidi ni agbaye!",
    "play_game_button": "Ṣere Ere Imọ-ọrọ Erogba",
    "subscribe_to_newsletter": "Forukọsilẹ fun Iwe iroyin wa",
    "enter_email": "Tẹ imeeli rẹ sii",
    "email_placeholder": "you@example.com",
    "subscribe_button": "Forukọsilẹ"
}

}

  